ArtMoney Plugin
8.17//Verzija
Prevedeno na hrvatski
Robert Krkic//Plugin autor
obi.echo@gmail.com//Autorica e-pošte
O programu
Varanje igre
<ms> <d>, <yyyy> //format datuma
Autorsko pravo (C) 1996-2021, System SoftLab
Ako ste pronašli neke greške ili
imate neke prijedloge, posaljite e-mail na
Posjetite ArtMoney stranicu za najnoviju verziju
Vrijednost
Pretraži
Filter
Broj vrijednosti
Prvo odaberite proces igre
Sada započnite pretraživanje u tom procesu
Filtrirajte sve dok se broj istih pojava više ne smanjuje
Oprostite, ništa niste pronašli. Pokušajte ponovo.
Onesposobi
Pronađeno
adrese
adrese
adresa
U tablici
Greška učitavanja
Greška u pretraživanju
Greška filtera
Format datoteke nije podržan
Nemogući broj za vaš tip
Ne mogu učitati
Proces pretraživanja
proces filtriranja
Sve postojeće
bajt
bajt
bajtova
Kriva metoda. Pokušajte s drugima.
sek
min
Niste odabrali tip za ovu metodu
Veličina tipa ne smije biti veća od
je promijenjen
nije promijenjen
je povećan
je smanjen
Ova je tablica stvorena novijom verzijom
Tablica oštećena
Greška pri pristupu datotekama
Integer 1 bajt
Integer 2 bajta
Integer 3 bajta
Integer 4 bajta
Integer 8 bajtova
Float 4 bajta
Float 6 bajtova
Float 8 bajtova
Float 10 bajtova
Tekst
Null-prekinuti tekst
Null niz
Pascalov niz
R.Integer 2 bytes // R.=obrnuto
R.Integer 3 bajta
R.Integer 4 bajta
R.Integer 8 bajta
R.Float 4 bajta
R.Float 6 bajta
R.Float 8 bajta
R.Float 10 bajta
R.Tekst
R.Null tekst
R.Paskalni niz
siječanj
veljača
ožujak
travanj
svibanj
lipanj
srpanj
kolovoz
rujan
listopad
studeni
prosinac
F // F=zamrzavanje
Pomoć
O programu
Odaberite proces
Očisti
Otvori
Sačuvaj
Dodaj
Dodaj Sve
Uredi
Kopiraj
Izbriši
Zamrzni
Odmrzni
Automatski dodajte offset
Informacija
Vrsta procesa
Vrijeme zamrzavanja (ms)
Vrijeme osvježavanja (ms)
Jezik sučelja
Prikaži adrese
Popup tipka
Generalno
Dodatno
Osobni
E-mail
Stalni komentar
Operativni sustav
Decimalni format
Poredak bajtova
Prioritet Skeniranja
Visok
Pun
Opcije
Otkazati
Normalan
Uredi adresu
Zamrzni
Veličina
Adresa
Opis
Tip
Obrnuto
Točna vrijednost
Slijed vrijednosti
Raspon vrijednosti
Nepoznata vrijednost
Kodirana vrijednost
Prilagođeno
Odaberite tip
Poredak bajtova
Normalno i obrnuto
SVI
Integer
Float
Proteklo vrijeme:
Preostalo vrijeme:
Ubrzati:
Pronađeno:
Igra
Komentar
Datum
Sistem
Tablične informacije
Napravio
Ime
Mjesto
Unos slijeda
Postavi pozivnu tipku
Obrni
Pretraži u ovom bloku memorije
Traži u rasponu adresa
Sacuvajte prostor na disku
iz
do
traži
filter
Korak
Korak //Postavite vrijednost
Postavite vrijednost
Odaberi sve
AUTO
Prikaži procese
Vidljiv
S prozorima
Podaci o procesu
Ubij proces
Prikaži prozor
Sakrij prozor
Jeste li sigurni da želite prekinuti proces?
Pristup je odbijen
Nije moguće prekinuti proces
Naziv datoteke
Vrsta procesa
Veličina podataka
Referent
Referentna vrijednost za mjerenje brzine skeniranja memorije
Čekaj
Vaš sustav
Posebni tipkovni prečaci
Dodaj vrijednost
Zaključaj ovaj prozor
Omogući poništavanje/ponavljanje filtriranja
Integer pogled
Nepotpisan
Potpisan
Poništite filtriranje
Ponovite filtriranje
Spremite filtriranje
Učitaj filtriranje
Trenutačni korak je
"Poništavanje filtriranja" nije omogućeno
"Ponovno filtriranje" nije omogućeno
"Učitavanje filtracije" nije omogućeno
povećana je za
smanjio se za
Sučelje
Prečac
Prečaci su omogućeni
Tipke prečaca prema zadanim postavkama
Glavni font
Font tablice
Boja lica
Promijeni boju
Boja gumba
Gumb Ellipse
OK
Uređivanje memorije
Heksadecimalni prikaz
Heksadecimalno uređivanje
Broj vrijednosti stupaca
Pogled ćelija
Trenutačna ćelija
Premještanje
kretanje u rezultatima pretraživanja
kreće se u tablici
kreće se u memorijskom bloku
premjestiti na adresu
Prvi
Prethodni
Sljedeći
Posljednji
Ukupno
Trenutno
Kopirajte područje
Umetnite područje
Dodaj u tablicu
Sve (standardno)
Integer (standard)
Float (standard)
Invertiranje odabira
Poravnajte stupce
<NO>
Pointer
Osvježi
Uređivanje odabrano
Skupina
Vidljiva grupa
Odaberite grupu
Spremite ovu adresu/pointer
Automatski primijenite offset na sve
Automatski primijenite offset grupi
Automatski primijenite offset spremanja adrese na sve
Automatski primijenite odstupanje spremanja adrese grupi
Naredbe s uputama
Postavite pointer na sve
Postavite pointer na grupu
Postavite štedni pointer na sve
Postavite pointer spremanja u grupu
Postavi pointere na ovu adresu
Postavite pointere za spremanje adrese
Potražite pointer na ovu adresu
Potražite pointer na početak bloka memorije
Poredaj
Poredajte prema opisu
Poredaj po adresi
Poredaj po vrijednosti
Poredaj po vrijednosti kao tekst
Poredaj po grupi
Sjedini
Greška pri spajanju
Obje tablice moraju biti kreirane od istog autora
Odaberite trenutačni proces
Charset
Prikaži vidljivu grupu
u grupi
Pretvaranje pointera u adrese
Postavite filter
Niz
<Datoteka nije pronađena>
<Pristup odbijen>
Urednik datoteka
Greške
<Veličina je promijenjena>
Izgled
Nema izgleda
Uredi font
Boja tablice
Spremanje memorije
Prema formuli
Proces
Zaustavite proces
Nastavi proces
Spremite proces
Učitaj proces
ID procesa
Thread
Datoteka(e)
Podaci o datotekama
Odaberite Datoteku
Odaberite Mapu
Broj datoteka
Ukupna veličina
Premještanje u mapu
Objekt
Tablica
Izlaz
Rezultat
Više
Kupite "ArtMoney Pro" preko interneta
Posjetite početnu stranicu
ArtMoney Priručnik
Kodiranje
Odaberite Kodiranje
Svjetlost
Nijansa
Prikaži glavni izbornik
Koristite neslužbene dodatke za jezike
Zaustavite proces tijekom pretraživanja
Spremi/Učitaj vrijednosti u datoteci
Knjižnica za gledatelje procesa
Mogućnosti mape
Maska datoteke
Vrijeme izmjene
Datum datoteke
Vrijeme datoteke
Nema ček
Zadnjih 15 minuta
Posljednji sat
Zadnji dan
Prošli mjesec
Prošle godine
Više od
Manje od
Ova je funkcija dostupna samo u ArtMoney Pro izdanju
Samo u ArtMoney Pro
Licencni ugovor
Slažem se s uvjetima i odredbama Ugovora o licenci
O PRO izdanju
Posebna zahvalnost
za izradu korisničkog priručnika
za logotip
za modul za postavljanje
za izradu ikona
za provjeru gramatike engleskog priručnika
za pomoć
za izgled (paket ThemeEngine)
za savjete i vrijedne primjedbe
za prijevod
za tablice
Matični broj
Nije registrirano
Nemoj ponovno pitati svoju lozinku
Samo za trenutnog korisnika sustava Windows
Zaustavite proces i izdatak
Prebaci i nastavite proces
Nepotrebna zagrada za zatvaranje
Potrebno zatvaranje zagrada
Nepotrebni navodi za zatvaranje
Nevažeći ID
Nevažeći broj argumenata (M1,M2...)
Nevažeći broj operacija (-,+)
Nevažeći broj uvjeta (<,>,=)
Nevažeći broj izraza
Nevažeći izraz
Ovaj korak ne postoji
Nevažeći uvjet
Nevažeći parametar za
Nema uvjeta
Pretraživanje
Registracija
Lozinka
Unesite lozinku i kliknite "U redu"
Pogrešna lozinka
Pogrešna ili stara ključna datoteka
Nema ključne datoteke
Zadano
Korisnik je otkazao
Ručni jezik
Proces nije pronađen ili pristup odbijen
Osvježite vrijednosti u tablici samo s fokusom obrasca
Veličina koda
Karta procesa
Adresa regije
Država
Zaštičeno područje
Zaštititi
Naziv modula
Ova funkcija radi samo u sustavu Windows 2000/XP/2003/VISTA/2008/7/8/2012/10
Spremanje/učitavanje procesa
Način
Nevažeći proces. Proces je promijenjen ili ponovno pokrenut.
Zatvori
U Excelu
Okrugla float vrijednost
Macromedia Flash
Opseg
Držite proces u memoriji
Rezervirana fizička memorija
Pokrenite novi proces
Instalirati
Stvorite prečac na radnoj površini
Sakrij proces
Prikaži proces
Imitator
Igraći sustav
Raspon adresa
Koristite opcije emulatora
Karta memorije emulatora
Emul.adresa
PC adresa
Želite li pretvoriti emulator adrese na računalo?
Želite li pretvoriti PC adrese u emulator?
Pogreška pretvorbe adrese
Automatski detektirajte emulator nazivom datoteke
Grupe
Prikaži stablo grupa
Nijedan
Lijevo
Desno
Nova grupa
Glavni
Jezik
Želite li izbrisati taj jezik?
Želite li dodati novi jezik?
Želite li promijeniti naziv jezika?
normalno zamrzavanje
može se povećati
može se smanjiti
od minimuma do maksimuma
Minimum
Maksimum
Kopiraj odabrano
Preuzmite "Spyware detektor procesa"
Program "Spyware Process Detector" nije pronađen na vašem računalu. Možete ga preuzeti i instalirati s web stranice tvrtke: www.systemsoftlab.com. Program može raditi zajedno s tvrtkom ArtMoney kao procesni odabir. Pomoću "detekcije spyware detekcije" možete otvoriti svaki skriveni proces i proces koji blokira otvaranje. Program prikazuje detaljne informacije o procesima koji se izvode na vašem računalu i otkriva spyware, trojance i viruse (ne otkrivaju vaš antivirusni program).
Pošaljite prijedloge ili izvješća o pogrešci u
Posjetite našu stranicu tvrtke i preuzmite druge programe
Ovo je besplatna ograničena verzija. Možete kupiti punu verziju za samo 24,90 dolara.
Samo registrirani korisnici dobivaju punu tehničku podršku i mogu koristiti sve dodatne funkcije.
Da biste kupili, provjerite jeste li povezani s internetom i kliknite gumb Registriraj online ispod.
Registrirajte se sada online
Instalacija usluge
Windows treba autentificirati korisnika za instalaciju usluge.
Instalirajte kao sljedeći korisnik
Korisničko ime
Domena
Pogreška pri instalaciji usluge
Prijava nije uspjela za korisnika
Skriveni mod
Sakrij moj proces
Sakrij moje prozore
Instalirana je stara servisna verzija. Ponovo pokrenite računalo da biste instalirali novu verziju.
Tablica se promijenila
Želite li spremiti promjene?
Pitajte za spremanje tablice sa nespremljenim promjenama kada izađete
Struktura
preskočena
Polje
Veličina strukture ne može biti veća od
Artikal
Nova stvar
Pretražite strukturu tablice
Pretražite strukturu grupe
Pretražite strukturu odabranih adresa
Pomakni gore
Pomicati prema dolje
Nabavite "ArtMoney Pro" besplatno
za provjeru gramatike ruskog priručnika
Vrsta zaobljenja
Zaokruži do najbliže
Zaokruži dolje
Zaokruži gore
Zaokruži prema nuli
Nastavi
Nabavite ga besplatno
Rastavljane
Upute za sastavljanje
Koristite adresiranje modula
Modul
Adresa u modulu
Pogreška pri pretvorbi
Ne mogu pretvoriti adresu modula: Nema takvog modula u procesu.
Skenirajte područje memorije sistemskih modula
Skeniranje područja memorije dijeljenih modula
Otvorena pogreška u procesu
Nije moguće otvoriti taj proces.
Pokušajte koristiti PRO izdanje.
Trebate PRO izdanje za ovu tablicu
Nevažeći registar
Nevažeća adresa
Nevažeća vrijednost
Vrijednost je previsoka
Nevažeća instalacija za sastavljanje
Pokrenite ArtMoney program kao administrator jednom. Da biste to učinili, kliknite na ArtMoney prečac i odaberite kontekstni izbornik "Pokreni kao administrator".
Pogreška pri početnoj usluzi
Pogreška pri otvaranju usluge
Pokušajte ponovo pokrenuti računalo
promijenio se
Pretvorba tablice
Želite li pretvoriti tablicu u 64-bitni način rada?
Želite li pretvoriti tablicu u 32-bitni način rada?
Došlo je do pogreške konverzije. Program ne može pretvoriti adrese u 32-bitni način rada.
Razdjeljivost adrese //Adresa razdjeljivosti
Isti //Dijeljivost sa 2
Cudan
Više od 4 //Dijeljivost sa 4
Više od 8 //Dijeljivost sa 8
Više od od 16 //Dijeljivost sa 16
Skenirajte samo statičke adrese u modulima
Opcije modula zaslona
Unesite registracijski kod
Zalijepite međuspremnik sa svojim registracijskim kodom (koristite tipku Ctrl-V ili "Zalijepi") i kliknite "U redu"
Zalijepi
Registracijski kod nije važeći
Registracijski kod je samo za engleski prijevod
Registracijski kod je samo za rusku verziju
Registracijski kod je samo za staru verziju
Registracijski kod ne radi više. Obratite se na sales@systemsoftlab.com za svoj novi registracijski kod
Ako ovdje ne vidite svoje ime i podatke, upotrijebite napuknu ili ukradenu verziju, a ta verzija ne radi ispravno!
Pointer Po Pointeru
Maksimalni pomak
Razina od
Potražite pokazivač na Pointer
Maksimalna 2 razina za SE izdanje!
Pokušajte onemogućiti izvršenje potpisa pokretača
Brzi način rada (upotrebljava više memorije)
MB
Automatski primijenite offset i kopirajte novu grupu
Adresa u bloku
Ne mogu pretvoriti adresu u blok: Nema takvih blokova u tom procesu.
Problem pretvorbe: Veličina bloka nije jedinstvena.
Razvrstajte pokazivače pomakom
Skrivanje teksta za potpuni neviđen način //samo VIP
Kupite ili prodajte račune internetskih igara
Nova verzija dostupna za preuzimanje
Provjerite nove verzije
Pointer s offsetom
Pretražite pokazivač s maksimalno dostupnim offsetom
dostupan je iz 2 koraka
Formula
Verzija
Uvijek na vrhu
Omogući "Uvijek na vrhu"
Onemogući "Uvijek na vrhu"
Provjerite svoju internetsku vezu! Nije moguće otvoriti systemsoftlab.com
Pokušajte postaviti opciju
Naziv/modul
Hex kod
Registrirajte se
Zastava
Priložite ispravljanje pogrešaka
Odvojite program za ispravljanje pogrešaka
Želite li priložiti program za ispravljanje pogrešaka u odabrani postupak?
Popis prekidnih točaka
Naredbe
Otkloniti neispravnost
Spremi podatke za uklanjanje pogrešaka
Učitajte informacije o uklanjanju pogrešaka
Tip jezika
x86-32 bita
x86-64 bita
Prekidna točka
Dodaj prekidnu točku
Uklonite prekidnu točku
Pokreni
Pokreni do
Do povratka
Prati korak
Praćenje koraka
Postavite naziv adrese
Ukloni adresu
Da
Ne
Vrsta debuggera
Standardni
Rukovanje iznimkama
Izvršiva vrsta prekida
Softver (int3 uputa)
Int3
Registri ispravljanja pogrešaka (maks 4)
registar
Izuzeci stranica
iznimke
Pristup tipu prekida
Pitajte kada priložite alat za ispravljanje pogrešaka za obradu
Koristite prekidne točke softvera ako se koriste svi registri za uklanjanje pogrešaka
Automatsko spremanje/učitavanje informacija o uklanjanju pogrešaka
Koristite simbole za uklanjanje pogrešaka
Put simbola
Aktivan
Pauza
Izvršiti
Svaki pristup
Pisati
Uvjeti
Promjene
Omogući SVE
Onemogući SVE
Pronađite uputu koja pristupa adresi
Na pristup memoriji
Na pisanje memorije
Pogreška uvjeta
Promjena pogreške
Podijeli sa nula
Pročitajte pogrešku
Pišite pogrešku
Pogrešna lijeva strana
Početak
Stop
Pristup
Izbriši rezultat
Podijelite po temama
Broj
Thread
8 bita
16-bita
32-bita
Hex
Hex
Float4
Float8
Hex slijed
server systemsoflab.com ne reagira ili nema internetske veze
Prijava je zabranjena
Taj kod možete aktivirati samo 2 puta dnevno
Registracijski kod je samo za VIP Edition
Sakrij prisutnost o uklanjanju pogrešaka
Spremi tablicu u Unicode
Nabavite veličinu do kraja funkcije (do povratka)
Licence
Skeniraj regije memorije
data pisanje
data samo-citanje
code pisanje
code samo-citanje
podjeljeno
sistem
cuvan
skriven
Multiplikat svake adrese
Ime adrese i lista simbola
Simboli mape
Korisnicka imena
Velika-mala slova
Cijele rijeci
Prva pozicija
Citaj/Pisi
Automatski detektiraj velicinu funkcije
Sakrij debug registre
Zakrpi ovu funkciju (strukture)
zaobidji zaštitu procesa
Koristite vlastite funkcije za pristup memoriji
Funkcije moda korisnika (zakaci na proces)
Funkcije moda kernela (preko drajvera)
Zakaci na proces bez OpenProcess
Potpisi
Trazi potpis
Dodaj potpis
Ofset
Trazi automatski
Staticna adresa
Regije
Editiraj kao assember kod
Kao assembler kod
Konvertiraj u HEX
Limitiraj unikatne ofsete po levelu
Mijenjanje koda
Zamjeni kod
Zamjeni sav kod automatski
<ZAMJENJENO>
<NIJE ZAMJENJENO>
<NEMA MODULA>
<NEMA BLOKA>
<NEMA POTPISA>
<NEMA VARIJABLE>
Injekcija koda
Injektiraj kod
Samo nakon uspjesne zamjene koda
Automatski zamijeni sav kod i injektiraj
Dozvoli da se automatski zamjeni sav kod i injektiraj
Pitaj za dozvolu za automatsko mijenjane svog kod i injekcije
Tablica sadrzi kod za injekciju i mijenjanje. Moze biti maliciozan kod! Skidaj tablice samo sa sigurnih stranica! Da li zelite injektirati kod u process?
Zamjeni sav kod i injektiraj
Prekini mjenjanje koda i injekciju
Potpisan
Orginalni potpis
Krivi potpis ordinala
Adresa od potpisa//pun
Adresa od potpisa.//skraceno
Adresa varijable/oznake//pun
Adresa varijable/oznake//skraceno
Nemogu konvertirati adresu od potpisa: Nema takvog potpisa.
Nemogu konvertirati adresu od varijable: Nema takve varijable.
Ime//varijabla ili oznaka
Velicina koda za mijenjanje
Jedna assembler instrukcija
Nekoliko assembler instrukcija
Linija
Greska relativne adrese (ofset je prevelik)
Invalidni multiplier
Natrag JMP greska
Nemogu alocirati memoriju
Dijelovi//Podrucja memorije
Postavi istu adresu
Ocisti istu adresu
od mininalne adrese
Servis
Pokazi pointer u heksadecimalnom
Koristi RAX(EAX) registar. Samo MOV instrukcija sa RAX(EAX) registrom moze citati/pisati absolutnu adresu!
Promijeni brzinu procesa
Brzina (%)
Normalno//brzina
Greska pri promjeni brzine procesa
Povecaj brzinu procesa
Smanji brzinu procesa
Stack
Pokazi kao stack
Sacuvaj stack thread
Povratna adresa
Parametar
Parametri
Pokazi parametre u jednoj liniji
Povratna adresa samo u modulu
Greska pri citanju memorije
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
D886697F